ChartsOfCalculationTypes/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>Начисления</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсобыйСпособОтраженияРасходовБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходовБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовНаЗПБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеСтатьиРасходовБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатратБУ</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыПериодаБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасходыПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиватьПоОтдельнойВедомости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВыплаты</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыНачисленийНеоблагаемыхВзносамиВПФ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийНеоблагаемыхВзносамиВПФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеоблагаетсяПФ</Name>
					<Comment>Выплаты, необлагаемые взносами в ПФ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеоблагаетсяЕСП</Name>
					<Comment>Выплаты, необлагаемые ЕСП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленийНеоблагаемыхЕСП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийНеоблагаемыхЕСП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмущественныйДоход</Name>
					<Comment>Признак имущественного дохода</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИмущественногоДохода</Name>
					<Comment>Вид имущественного дохода</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИмущественногоДохода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛьготаПоНДФЛ</Name>
					<Comment>Льгота по налогу на доходы физ.лиц</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготыПоНДФЛ</Name>
					<Comment>Вид льготы по налогу на доходы физ.лиц</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛьготыПоНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДохода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

Enums/ВидыДохода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыДохода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмущественныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяВыгода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfCalculationTypes/Начисления/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если Не ОсобыйСпособОтраженияРасходовБУ Тогда
		СпособОтраженияРасходовБУ="";
	КонецЕсли; 
	
	Если ОсобыйСпособОтраженияРасходовБУ И СпособОтраженияРасходовБУ.Пустая() Тогда
		Сообщить("Не выбран способ отражения расходов (БУ)!");
		ОсобыеСтатьиРасходовБУ=ложь;
		СтатьяЗатратБУ="";
		РасходыПериодаБУ="";
		Отказ=истина;
	КонецЕсли; 	
	
	Если НеоблагаетсяЕСП И ВидНачисленийНеоблагаемыхЕСП.Пустая() Тогда
		Сообщить("Не выбран вид выплат, на которые не начисляется ЕСП!");
		Отказ = Истина;
	КонецЕсли; 	
	
	Если НеоблагаетсяПФ И ВидыНачисленийНеоблагаемыхВзносамиВПФ.Пустая() Тогда
		Сообщить("Не выбран вид выплат, на которые не начисляются взносы в ПФ!");
		Отказ = Истина;
	КонецЕсли; 	
	
	Если ВидДохода = Перечисления.ВидыДохода.ИмущественныйДоход И ВидИмущественногоДохода.Пустая() Тогда
		Сообщить("Не выбран вид имущественного дохода!");
		Отказ = Истина;
	КонецЕсли; 	
	
	Если ЛьготаПоНДФЛ И ВидЛьготыПоНДФЛ.Пустая() Тогда
		Сообщить("Не выбран вид льготы по налогу на доход физ.лиц!");
		Отказ = Истина;
	КонецЕсли; 	
	
КонецПроцедуры
